using Plugin.Geolocator;
using SlideOverKit;
using System;
using System.Collections.Generic;
using Xamarin.Forms;
using Plugin.Geolocator.Abstractions;
using System.Net;
using Newtonsoft.Json.Linq;
using System.Text;
using System.IO;
using System.Xml;
using System.Linq;
using Plugin.LocalNotifications;

namespace ZadElMuslim
{
    public class Main : ContentPage, IMenuContainerPage

    {

        public SlideMenuView SlideMenu { get; set; }
        public Action ShowMenuAction { get; set; }
        public Action HideMenuAction { get; set; }
        public List<Azkar> items;
        public ListView lv;
        public Label seclbl;
        public Position savedPosition;
        public bool gps = false;
        public Label citylbl;
        public Label rise;
        public Label set;
        public static List<alarmproperties> azkar { get; set; }
        public string _img;
        public string[] m = new string[] { "nouman.jpg", "masjed.jpg", "mecca.png" };
        void OnTap(object sender, ItemTappedEventArgs e)
        {
            var zikr = e.Item as Azkar;
            Navigation.PushAsync(new Zikr(zikr.id));
        }
        public Main()
        {
            Random r = new Random();
            int no = r.Next(0, 2);
            _img = m[no];
            this.BackgroundImage = _img;
            azkar = new List<alarmproperties>();
            var fontModel = new MyFontModel();
            BindingContext = fontModel;
            AzkarDB azkardb = new AzkarDB(Path.Combine(Environment.GetFolderPath(Environment.SpecialFolder.LocalApplicationData), "Azkar.db3"));
            List<Azkar> az = new List<Azkar>()
            {
                new Azkar()
            {
                id=1,
                title = "اذكار الصباح",
                isfavourite = false,
                body="من أذكار الصباح والمساء 1- قراءة قل هو الله أحد والمعوذتين ثلاث مرات() تكفي من كل شيء. 2- اللهم عالم الغيب والشهادة، فاطر السموات والأرض رب كل شيء ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي ومن شر الشيطان وشركه() وأن (أقترف على نفسي سوءًا أو أجره إلى مسلم)(). 3- لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير عشر مرات(). 4- «سبحان الله وبحمده» مائة مرة(). 5- من قال:«بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم» ثلاث مرات لم يضره شيء(). 6- اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك النشور(). 7- «اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء بذنبي فاغفر لي، فإنه لا يغفر الذنوب إلا أنت»() من قالها من النهار موقنا بها فمات من يومه قبل أن يمسي فهو من أهل الجنة ومن قالها من الليل وهو موقنا بها فمات قبل أن يصبح فهو من أهل الجنة. ومعنى (أبوء) أقر وأعترف وهذا سيد الاستغفار. 8- «اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يدي ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي»() يعني الخسف. 9- «أمسينا وأمسى الملك لله والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، رب أعوذ بك من الكسل وسوء الكبر، رب أعوذ بك من عذاب في النار وعذاب في القبر» وإذا أصبح قال:«أصبحنا وأصبح الملك لله......»().",
            },new Azkar()
            {
                id=2,
                title = "من الاذكار الخاصة الصباح ",
                body = "من قال:1- «لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير» في اليوم مائة مرة، كانت له عدل عشر رقاب، وكتبت له مائة حسنة ومحيت عنه مائة سيئة وكانت له حرزا من الشيطان يومه ذلك حتى يمسي(). 2- «أصبحنا على فطرة الإسلام وعلى كلمة الإخلاص وعلى دين نبينا محمد  وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين»(). 3- «سبحان الله وبحمده. عدد خلقه. ورضا نفسه. وزنة عرشه. ومداد كلماته» ثلاث مرات(). من الأذكار الخاصة بالمساء «أعوذ بكلمات الله التامات من شر ما خلق». أخرجه مسلم جـ17 ص31 ورواه الترمذي بلفظ (من قال حين يمسي وحين يصبح ثلاث مرات أعوذ بكلمات الله التامات من شر ما خلق لم تضره حمة تلك الليلة) وقال حديث حسن.",
                isfavourite = false
            }
            ,new Azkar()
            {
                id=3,
                title = "أذكار عامة",
                body = "«سبحان الله والحمد لله ولا إله إلا الله والله أكبر»() من قال:«سبحان الله وبحمده» مائة مرة حطت خطاياه وإن كانت مثل زبد البحر().",
                isfavourite = false
            }
            ,new Azkar()
            {
                id=4,
                title = "من أذكار النوم",
                body="من أذكار النوم 1- عن عائشة رضي الله تعالى عنها أن النبي  كان إذا أوى إلى فراشه كل ليلة جمع كفيه ثم نفث فيهما فقرأ فيهما (قل هو الله أحد) و(قل أعوذ برب الفلق) و(قل أعوذ برب الناس) ثم يمسح بهما ما استطاع من جسده يبدأ بهما على رأسه ووجهه وما أقبل من جسده يفعل ذلك ثلاث مرات(). 2- «الله أكبر» أربعا وثلاثين مرة «الحمد لله» ثلاثا وثلاثين مرة «سبحان الله» ثلاثا وثلاثين مرة(). 3- «باسمك ربي وضعت جنبي وبك أرفعه إن أمسكت نفسي فارحمها وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين»(). 4- قال النبي :«من قرأ الآيتين من آخر سورة البقرة في ليلة كفتاه» رواه البخاري ومسلم. أي كفتاه شر ما يؤذيه وهما قوله تعالى:(آمن الرسول بما أنزل إليه من ربه والمؤمنون...) الخ السورة. 5- «اللهم قني عذابك يوم تبعث عبادك» ثلاث مرات(). 6- «الحمد لله الذي أطعمنا وسقانا وكفانا وآوانا فكم ممن لا كافي له ولا مؤوي»(). 7- «اللهم خلقت نفسي وأنت تتوفاها لك مماتها ومحياها إن أحييتها فاحفظها وإن أمتها فاغفر لها اللهم إني أسألك العافية»(). 8- قراءة آية الكرسي. من قرأها لا يزال عليه من الله حافظ ولا يقربه شيطان حتى يصبح() وهي (الله لا إله إلا هو الحي القيوم) الآية 255 من سورة البقرة. 9- «باسمك اللهم أموت وأحيا»(). 10- عن البراء بن عازب رضي الله عنهما قال:قال لي رسول الله :«إذا أتيت مضجعك فتوضأ وضوءك للصلاة ثم اضطجع على شقك الأيمن وقال:اللهم أسلمت نفسي إليك وفوضت أمري إليك وألجأت ظهري إليك رغبة ورهبة إليك لا ملجأ ولا منجا منك إلا إليك آمنت بكتابك الذي أنزلت وبنبيك الذي أرسلت، فإن مت، مت على الفطرة، واجعلهن آخر ما تقول»() وفي رواية للبخاري وإن أصبحت أصبت خيرا. 11- ويقرأ سورة (قل يا أيها الكافرون) فإنها براءة من الشرك()."
                ,isfavourite = false
            }
                 ,new Azkar()
            {
                id=5,
                title = "من آداب النوم",
                body="- عن عائشة رضي الله عنها قالت:«كان النبي  إذا أراد أن ينام وهو جنب غسل فرجه وتوضأ للصلاة»(). 2- قال :«لا تتركوا النار في بيوتكم حين تنامون»(). إذا رأى في منامه ما يحب 1- يعرف أن ذلك بشرى من الله تعالى(). 2- يحمد الله تعالى عليها(). 3- يُحَدِّثُ بها من يحب(). إذا رأى ما يكره في منامه 1- يعرف أن ذلك من الشيطان(). 2- يستعيذ بالله من شرها(). 3- يستعيذ بالله من شر الشيطان(). 4- لا يحدث بها أحدًا(). 5- يتفل عن يساره ثلاثًا(). 6- يصلي(). 7- وإذا أراد أن يعود إلى النوم فليتحول عن الجنب الذي كان عليه(). 8- فإنها لا تضره()."
                ,isfavourite = false
            }
                 ,new Azkar()
            {
                id=6,
                title = "ما يقول إذا استيقظ",
                body="ما يقول إذا استيقظ 1- عن عبادة بن الصامت رضي الله تعالى عنه عن النبي  قال:«من تعار() من الليل فقال:لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير. الحمد لله وسبحان الله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله». ثم قال:«اللهم اغفر لي أو دعا استجيب له فإن توضأ وصلى قبلت صلاته»(). 2- «الحمد لله الذي أحيانا بعدما أماتنا وإليه النشور»(). 3- «الحمد لله الذي رد علي روحي وعافاني في جسدي وأذن لي بذكره»(). 4- قال :«إذا استيقظ أحدكم من نومه فلا يدخل يده في الإناء حتى يغسلها ثلاثًا فإن أحدكم لا يدري أين باتت يده»(). 5- وقال :«إذا استيقظ أحدكم من منامه فتوضأ فليستنثر ثلاث مرات فإن الشيطان يبيت على خياشيمه»(). ما يقول عند دخول الخلاء «بسم الله()، اللهم إني أعوذ بك من الخبث والخبائث»(). عند الخروج من الخلاء «غفرانك»()."
                ,isfavourite = false
            }
                 ,new Azkar()
            {
                id=7,
                title = "عند الوضوء",
                body="«بسم الله» رواه مسلم وغيره كما في الوابل الصيب ص286(). عند الفراغ من الوضوء «أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدًا عبده ورسوله() اللهم اجعلني من التوابين واجعلني من المتطهرين»(). عند سماع الأذان يقول كما يقول المؤذن() ويقول عند الحيعلتين:«لا حول ولا قوة إلا بالله»() ثم يقول:«اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدًا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته»()."
                ,isfavourite = false
            }
                 ,new Azkar()
            {
                id=8,
                title = "عند دخول المسجد",
                body="1- يسلم على النبي () ثم يقول:«اللهم افتح لي أبواب رحمتك»(). 2- «أعوذ بالله العظيم وبوجهه الكريم وسلطانه القديم من الشيطان الرجيم»(). (فائدة) خمس سنن عن رسول الله  في إجابة المؤذن:أحدها:الصلاة عليه . الثانية:أن يقول مثل ما يقول المؤذن(). الثالثة:أن يدعو له  بالوسيلة والفضيلة والمقام المحمود. والرابعة:أن يقول:«رضيت بالله ربا وبالإسلام دينا وبمحمد رسولا»(). والخامسة:أن يدعو الله بعد إجابة المؤذن وصلاته على رسوله وسؤاله له الوسيلة، فإن الدعاء لا يرد بين الأذان والإقامة(). فهذه خمسة وعشرون سنة في اليوم والليلة لا يحافظ عليها إلا السابقون()."                ,isfavourite = false
            }
                 ,new Azkar()
            {
                id=9,
                title = "ما يقال عند الركوع",
                body="1- «سبحان ربي العظيم() سبحان ربي العظيم وبحمده» ثلاثًا()، وأحيانًا يرددها أكثر من ذلك. 2- «سبحانك اللهم ربنا وبحمدك اللهم اغفر لي»(). 3- «سبوح قدوس رب الملائكة والروح»(). ما يقال بعد الرفع من الركوع ربنا() لك الحمد ملء السموات والأرض وملء ما شئت من شيء بعد أهل الثناء والمجد أحق ما قال العبد وكلنا لك عبد اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد()."
                }
                 ,new Azkar()
            {
                id=10,
                title = "ما يقال عند السجود",
                body="1- «سبحانك اللهم ربنا وبحمدك اللهم اغفر لي»(). 2- «سبحان ربي الأعلى» ثلاث مرات() وأحيانا يكررها أكثر من ذلك. 3- «سبوح قدوس رب الملائكة والروح»(). 4- «اللهم اغفر لي ذنبي كله دقه وجله وأوله وآخره وعلانيته وسره»(). 5- «اللهم أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك»()."
                }                 ,new Azkar()
            {
                id=11,
                title = "ما يقال بين السجدتين",
                body="1- «رب اغفر لي رب اغفر لي»(). 2- «اللهم اغفر لي وارحمني واجبرني() واهدني وارزقني»(). ما يقال بعد التشهد يتخير من الدعاء ما شاء ومن ذلك:1- «اللهم إني أعوذ بك من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن فتنة المسيح الدجال»(). 2- «اللهم إني ظلمت نفسي ظلمًا كثيرًا ولا يغفر الذنوب إلا أنت فاغفر لي مغفرة من عندك وارحمني إنك أنت الغفور الرحيم»(). 3- «اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أسرفت وما أنت أعلم به مني أنت المقدم وأنت المؤخر لا إله إلا أنت»(). (فائدة) (المواضع التي كان النبي  يدعو فيها في الصلاة، سبعة مواطن)(). أحدها:بعد تكبيرة الإحرام في محل الاستفتاح. الثاني:قبل الركوع وبعد الفراغ من القراءة في الوتر() والقنوت العارض في الصبح قبل الركوع إن صح ذلك، فإن فيه نظرًا. الثالث:بعد الاعتدال من الركوع، كما ثبت ذلك في «صحيح مسلم» من حديث عبد الله بن أبي أوفى:كان رسول الله  إذا رفع رأسه من الركوع قال:«سمع الله لمن حمده، اللهم ربنا لك الحمد ملء السموات، وملء الأرض، وملء ما شئت من شيء بعد، اللهم طهرني بالثلج والبرد والماء البارد، اللهم طهرني من الذنوب والخطايا كما ينقى الثوب الأبيض من الوسخ»(). الرابع:في ركوعه كان يقول:«سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي»(). الخامس:في سجوده، وكان فيه غالب دعائه. السادس:بين السجدتين. السابع:بعد التشهد وقبل السلام، وبذلك أمر في حديث أبي هريرة(). وحديث فضالة بن عبيد() وأمر أيضا بالدعاء في السجود. وأما الدعاء بعد السلام من الصلاة مستقبل القبلة أو المأمومين، فلم يكن ذلك من هديه  أصلاً، ولا روي عنه بإسناد صحيح، ولا حسن. وأما تخصيص ذلك بصلاتي الفجر والعصر، فلم يفعل ذلك هو ولا أحد من خلفائه، ولا أرشد إليه أمته، وإنما هو استحسان رآه من رآه عوضًا من السنة بعدهما، والله أعلم. وعامة الأدعية، المتعلقة بالصلاة إنما فعلها فيها."
                }
                ,new Azkar()
            {
                id=12,
                title = "ما يقال بعد السلام من الصلاة",
                body="1- «أستغفر الله، أستغفر الله، أستغفر الله. اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام»(). 2- «لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير، اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد»(). 3- «لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير، لا حول ولا قوة إلا بالله، لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل وله الثناء الحسن لا إله إلا الله مخلصين له الدين ولو كره الكافرون»(). 4- سبحان الله (33 مرة)، الحمد لله (33 مرة)، الله أكبر (33 مرة) ثم يقول تمام المائة:«لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير»(). 5- «اللهم أعني على ذكرك وشكرك وحسن عبادتك»(). 6- اللهم إني أعوذ بك من الجبن وأعوذ بك أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وأعوذ بك من عذاب القبر(). 7- قراءة آية الكرسي:اللهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ(). 8- قراءة المعوذتين. بسم الله الرحمن الرحيم قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ. بسم الله الرحمن الرحيم قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ(). 9- «اللهم إني أعوذ بك من الكفر والفقر وعذاب القبر»(). ملاحظة:أخي المسلم حافظ على هذه الأذكار بعد كل صلاة ليحفظك الله بها وفقك الله لكل خير وحفظك من كل سوء وجعلك مباركًا أينما كنت وأعانك على ذكره وشكره وحسن عبادته."
                }
                ,new Azkar()
            {
                id=13,
                title = "ما يقول في المسجد",
                body="يستحب الإكثار فيه من ذكر الله تعالى والتسبيح والتهليل والتحميد والتكبير وغيرها من الأذكار، ويستحب فيه قراءة حديث رسول الله  وعلم الفقه وسائر العلوم الشرعية، قال الله تعالى فِي بُيُوتٍ أَذِنَ اللهُ أَنْ تُرْفَعَ وَيُذْكَرَ فِيهَا اسْمُهُ يُسَبِّحُ لَهُ فِيهَا بِالْغُدُوِّ وَالآصَالِ * رِجَالٌ الآية [النور:35] وقال تعالى:وَمَنْ يُعَظِّمْ شَعَائِرَ اللهِ فَإِنَّهَا مِنْ تَقْوَى الْقُلُوبِ [الحج:32] وقال تعالى:وَمَنْ يُعَظِّمْ حُرُمَاتِ اللهِ فَهُوَ خَيْرٌ لَهُ عِنْدَ رَبِّهِ [الحج:30]. وروينا عن بريدة  قال:قال رسول الله :«إنما بنيت المساجد لما بنيت له» رواه مسلم في «صحيحه». وعن أنس :«أن رسول الله  قال للأعرابي الذي بال في المسجد:إن هذه المساجد لا تصلح لشيء من هذا البول ولا القذر، إنما هي لذكر الله تعالى والصلاة وقراءة القرآن» رواه مسلم في صحيحه."
                }
                ,new Azkar()
            {
                id=14,
                title = "ما يقال عند الخروج من المسجد",
                body="«اللهم إني أسألك من فضلك»(). ما يقال عند دخول المنزل «اللهم إني أسألك خير المولج وخير المخرج، بسم الله ولجنا، وبسم الله خرجنا، بسم الله ولجنا، وبسم الله خرجنا، وعلى ربنا توكلنا». ثم يسلم على أهله(). ما يقال عند الخروج من المنزل «بسم الله توكلت على الله اللهم إني أعوذ بك من أن أضل أو أضل أو أزل أو أزل أو أظلم أو أظلم أو أجهل أو يجهل علي»(). ما يقال عند نزول المنزل «أعوذ بكلمات الله التامات من شر ما خلق»(). من قال هذا لم يضره شيء حتى يرتحل من منزله ذلك. ما يقال عند رؤية الهلال «الله أكبر، اللهم أهله علينا بالأمن والإيمان والسلامة والإسلام والتوفيق لما تحب وترضى، ربنا وربك الله»()."
                }
                               ,new Azkar()
            {
                id=15,
                title = "ما يقال عند دخول المنزل",
                body="«اللهم إني أسألك خير المولج وخير المخرج، بسم الله ولجنا، وبسم الله خرجنا، بسم الله ولجنا، وبسم الله خرجنا، وعلى ربنا توكلنا». ثم يسلم على أهله"
                               }
                               ,new Azkar()
            {
                id=16,
                title = "ما يقال عند الخروج من المنزل",
                body="«بسم الله توكلت على الله اللهم إني أعوذ بك من أن أضل أو أضل أو أزل أو أزل أو أظلم أو أظلم أو أجهل أو يجهل علي»(). ما يقال عند نزول المنز"
                               }
                               ,new Azkar()
            {
                id=17,
                title = "ما يقال عند نزول المنزل",
                body="«أعوذ بكلمات الله التامات من شر ما خلق» . من قال هذا لم يضره شيء حتى يرتحل من منزله ذلك."
                               },new Azkar()
            {
                id=18,
                title = "ما يقال عند رؤية الهلال",
                body="«الله أكبر، اللهم أهله علينا بالأمن والإيمان والسلامة والإسلام والتوفيق لما تحب وترضى، ربنا وربك الله» ."
             }
           ,new Azkar()
            {
                id=19,
                title = "ما يقال عند رؤية المطر",
                body="«اللهم صيبا نافعاً. «مطرنا بفضل الله ورحمته»"
                               }
       ,new Azkar()
            {
                id=20,
                title = "ما يقال عند تناول الطعام",
                body="«الحمد لله الذي عافاني مما ابتلاك به وفضلني على كثير ممن خلق تفضيلا»() من قال هذا لم يصبه ذلك البلاء."
                               }
                               ,new Azkar()
            {
                id=21,
                title = "ما يقال لمن تزوج",
                body="«بارك الله لك وبارك عليك وجمع بينكما في الخير»  ويقول عند الجماع «اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا فإنه إن يقدر بينهما ولد لم يضره الشيطان أبدا» ."
                               }
                               ,new Azkar()
            {
                id=22,
                title = "ما يقال عند الانتهاء من الطعام",
                body= "1- «الحمد لله الذي كفانا وأروانا غير مكفي ولا مكفور»(). 2- «الحمد لله كثيرا طيبا مباركا فيه غير مكفي ولا مودع ولا مستغني عنه ربنا»(). وحمد الله بعد الأكل والشرب من أسباب رضا الله عن العبد ومن أسباب المغفرة والزيادة."
                               }
                               ,new Azkar()
            {
                id=23,
                title = "ما يقال عند صيحة الديكة و نهيق الحمار و نباح الكلاب",
                body="«بسم الله توكلت على الله اللهم إني أعوذ بك من أن أضل أو أضل أو أزل أو أزل أو أظلم أو أظلم أو أجهل أو يجهل علي»(). ما يقال عند نزول المنزل"
                               }
                               ,new Azkar()
            {
                id=24,
                title = "ما يقال عند دخول المقابر",
                body="«السلام عليكم أهل الديار من المؤمنين والمسلمين وإنا إن شاء الله للاحقون نسأل الله لنا ولكم العافية»()."
                               }
                               ,new Azkar()
            {
                id=25,
                title = "ما يقال عند دخول السوق",
                body="«لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو حي لا يموت بيده الخير وهو على كل شيء قدير»() من قال ذلك كتب الله له ألف ألف حسنة ومحا عنه ألف ألف سيئة ورفع له ألف ألف درجة()"
                               }
                               ,new Azkar()
            {
                id=26,
                title = "ما يقال عند لبس الثوب الجديد",
                body="اللهم لك الحمد أنت كسوتنيه أسألك من خيره وخير ما صنع له وأعوذ بك من شره وشر ما صنع له»() رواه أبو داود والترمذي وقال حديث حسن."
                               }
                               ,new Azkar()
            {
                id=27,
                title = "ما يقال إذا عصفت الريح",
                body="ما يقال إذا عصفت الريح «اللهم إني أسألك خيرها وخير ما فيها وخير ما أرسلت به وأعوذ بك من شرها وشر ما فيها وشر ما أرسلت به». رواه مسلم."
                               }
                               ,new Azkar()
            {
                id=28,
                title = "تشميت العاطس",
                body="قال :إذا عطس أحدكم فليقل:«الحمد لله» وليقل له أخوه:«يرحمك الله»، فإذا قال له يرحمك الله فليقل:«يهديكم الله ويصلح بالكم»()."
                               }
                                                              ,new Azkar()
            {
                id=29,
                title = "في التثاؤب",
                body="قال :إذا عطس أحدكم فليقل:«الحمد لله» وليقل له أخوه:«يرحمك الله»، فإذا قال له يرحمك الله فليقل:«يهديكم الله ويصلح بالكم»()."
                               }
                               ,new Azkar()
            {
                id=30,
                title = "دعاء الكرب",
                body="كفارة المجلس"
                               }
                               ,new Azkar()
            {
                id=31,
                title = "كفارة المجلس",
                body="«سبحانك اللهم وبحمدك، أشهد أن لا إله إلا أنت، أستغفرك، وأتوب إليك». رواه أبو داود والترمذي وابن حبان والحاكم وقال الترمذي حسن صحيح."
                               }
                               ,new Azkar()
            {
                id=32,
                title = "دعاء الاستخارة الشرعية",
                body="إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ثم ليقل:«اللهم إني أستخيرك بعلمك، وأستقدرك بقدرتك، وأسألك من فضلك العظيم، فإنك تقدر ولا أقدر، وتعلم ولا أعلم، وأنت علام الغيوب. اللهم إن كنت تعلم أن هذا الأمر (ويسمي حاجته) خير لي في ديني ومعاشي وعاقبة أمري - أو قال عاجل أمري وآجله - فاقدره لي ويسره لي ثم بارك لي فيه، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري - أو قال في عاجل أمري وآجله - فاصرفه عني، واصرفني عنه، واقدر لي الخير حيث كان ثم رضني به» رواه البخاري."
                               }
                               ,new Azkar()
            {
                id=33,
                title = "إذا خاف قومًا",
                body="قال:«اللهم إنا نجعلك في نحورهم ونعوذ بك من شرورهم». رواه أبو داود وابن السني وإسناده صحيح."
                               }
                               ,new Azkar()
            {
                id=34,
                title = "إذا وقع مالا يختاره قال",
                body="«قدر الله وما شاء فعل». ولا يقول لو، فإن لو تفتح عمل الشيطان. رواه مسلم."
                               }
                               ,new Azkar()
            {
                id=35,
                title = "ويقول عند المصيبة",
                body="«إنا لله وإنا إليه راجعون، اللهم أجرني في مصيبتي واخلف لي خيرًا منها». رواه مسلم. إذا قال ذلك آجره الله في مصيبته وأخلف له خيرًا منها."
                               }
                               ,new Azkar()
            {
                id=36,
                title = "دعاء السفر",
                body="يكبر ثلاثا ثم يقول:«سبحان الذي سخر لنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون، اللهم إني أسألك في سفري هذا البر والتقوى، ومن العمل ما ترضى، اللهم هون علينا سفرنا هذا واطو عنا بُعْدَهُ. اللهم أنت الصاحب في السفر والخليفة في الأهل. اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر، وسوء المنقلب في المال والأهل والولد». وإذا رجع قالهن وزاد فيهن:(آيبون تائبون عابدون لربنا حامدون) رواه أحمد والبزار ومسلم وغيرهم."
                               }
                               ,new Azkar()
            {
                id=37,
                title = "ما يدعى به للمريض وما يدعو به",
                body="قال الله تعالى:1- وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ سورة غافر آية:60. 2- ومرض نبي الله أيوب عليه السلام فدعا الله تعالى فشفاه، قال تعالى:وَأَيُّوبَ إِذْ نَادَى رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ * فَاسْتَجَبْنَا لَهُ فَكَشَفْنَا مَا بِهِ مِنْ ضُرٍّ سورة الأنبياء آية:83 - 84. 3- وكان نبينا محمد عليه الصلاة والسلام يضع يده على المريض ويقول:«اللهم رب الناس أذهب البأس اشف أنت الشافي لا شفاء إلا شفاؤك شفاء لا يغادر سقمًا» متفق عليه. 4- وقال للذي شكا إليه مرضًا:«ضع يدك على الذي يألم من جسدك وقل:(باسم الله) ثلاثا، وقل سبع مرات:أعوذ بعزة الله وقدرته من شر ما أجد وأحاذر». رواه مسلم وأهل السنن زاد النسائي فأذهب الله ما كان بي. 5- وقال:«من عاد مريضًا لم يحضره أجله فقال عنده سبع مرات أسأل الله العظيم رب العرش العظيم أن يشفيك إلا عافاه الله من ذلك المرض». رواه الترمذي وأبو داود وقال حديث حسن، وقال الحاكم صحيح على شرط البخاري. 6- روى مسلم أن النبي  اشتكى فرقاه جبريل بقوله:«باسم الله أرقيك من كل شيء يؤذيك من شر كل نفس أو عين حاسد الله"
                               }
                               };
            if (azkardb.GetAzkar().Count == 0)
            {
                foreach (Azkar ziikr in az)
                {
                    azkardb.AddZikr(ziikr);
                }
            }
                List<Azkar> y = azkardb.GetAzkar();
            DataTemplate AzkarTemplate = new DataTemplate(() =>
            {
                var grid = new Grid();
                var title = new Label { FontSize = 30, TextColor = Color.White, FontFamily = fontModel.Android };
                title.SetBinding(Label.TextProperty, "title");
                grid.Children.Add(title);
                return new ViewCell { View = grid };
            });
            lv = new ListView { ItemTemplate = AzkarTemplate, ItemsSource = y,HasUnevenRows=true,HeightRequest=5000 };
            StackLayout stacklayout = new StackLayout
            {
                Margin= new Thickness(10,5,10, 10)
            };
            citylbl = new Label { FontSize = 25, Margin = 0, Text = "Getting your Location", FontFamily = fontModel.Android, TextColor = Color.White, HorizontalTextAlignment = TextAlignment.Center };
            rise = new Label { FontSize = 20, Margin = 0, TextColor = Color.White, HorizontalTextAlignment = TextAlignment.Center, FontFamily = fontModel.Android };
            set = new Label { FontSize = 20,Margin=0, TextColor = Color.White, HorizontalTextAlignment = TextAlignment.Center, FontFamily = fontModel.Android };
            stacklayout.Children.Add(citylbl);
            stacklayout.Children.Add(rise);
            stacklayout.Children.Add(set);
            stacklayout.Children.Add(lv);
            Content = new ScrollView
            {
                Content = stacklayout
            };
            this.ToolbarItems.Add(new ToolbarItem
            {
                Command = new Command(() => {
                    if (this.SlideMenu.IsShown)
                    {
                        HideMenuAction?.Invoke();
                    }
                    else
                    {
                        ShowMenuAction?.Invoke();
                    }
                }),
                Icon = "menu.png",
                Priority = 0,


            });
            lv.ItemTapped += this.OnTap;
            this.SlideMenu = new Left();
            showloc();
            List<alarmproperties> tazkir = Tazkir.alarm;
            List<alarmproperties>  tazkir2 =azkar;
            if (tazkir2 == null || tazkir2.Count == 0)
            {
            }
            else
            {
                foreach (alarmproperties a in tazkir2)
                {
                    Random rnd = new Random();
                    if (a.time < DateTime.Now)
                    {
                    }

                    else
                    {
                        Random rnnd = new Random();
                        int rand = rnnd.Next(1, 500);
                        CrossLocalNotifications.Current.Show(a.title, a.body, rand, a.time);
                    }

                }

            }
            tazkir2.Clear();
        }
        private async void showloc()
        {
                LocationDB location = new LocationDB(Path.Combine(Environment.GetFolderPath(Environment.SpecialFolder.LocalApplicationData), "location.db3"));
                List<LocationModel> loc = location.GetLoc();
                var x = loc.Count;
                if (loc.Count > 0)
                {
                    foreach (LocationModel l in loc)
                    {
                        try
                        {
                            XmlDocument citydoc = new XmlDocument();
                            citydoc.Load("https://maps.googleapis.com/maps/api/geocode/xml?latlng=" + l.Latitude + "," + l.Longitude + "&location_type=ROOFTOP&result_type=street_address&key=AIzaSyDdXtH7SX4CmpOoHdW2pFfjdIqYpYvFURk");

                            XmlNodeList citynode = citydoc.GetElementsByTagName("result");
                            XmlNode xcitynode = citynode.Item(0);
                            string il = xcitynode.SelectSingleNode("address_component[5]/long_name").InnerText;
                            citylbl.Text = il + " موقعك الحالي ";
                            var client = new WebClient();
                            var content = client.DownloadString("https://api.sunrise-sunset.org/json?lat=" + l.Latitude + "&lng=" + l.Latitude + "&date=today");
                            var sb = new StringBuilder(content);
                            sb.Replace("\\\t", "\t");
                            JToken token = JToken.Parse(sb.ToString());
                            string sunrise = token.SelectToken("results.sunrise").ToString();
                            rise.Text = sunrise + "موعد اذكار الصباح ";
                            string t = sunrise.Replace("AM", "");
                            TimeSpan val = TimeSpan.Parse(t);
                            DateTime val2 = DateTime.Today.AddMinutes(val.Minutes);
                            val2 = DateTime.Today.AddHours(val.Hours).AddMinutes(val.Minutes);
                            azkar.Add(new alarmproperties { time = val2, title = "اذكار الصباح", body = "اصبحنا و اصبح الملك لله" });
                            string sunset = token.SelectToken("results.sunset").ToString();
                            set.Text = sunset + "موعد اذكار المساء";

                            string s = sunset.Replace("PM", "");
                            TimeSpan sunsettime = TimeSpan.Parse(s);
                            DateTime sunsetalarm = DateTime.Today.AddMinutes(sunsettime.Minutes);
                            sunsetalarm = DateTime.Today.AddHours(sunsettime.Hours).AddMinutes(sunsettime.Minutes);
                            var sunsetpm = sunsetalarm.AddHours(Double.Parse("12"));
                            azkar.Add(new alarmproperties { time = sunsetpm, title = "اذكار المساء", body = "امسينا و امسي الملك لله" });
                        }
                        catch (Exception ex)
                        {
                            await DisplayAlert("تعذر تحديد موقعك", "من فضلك قم بالتأكد من تشغيل الانترنت و محدد الموقع  و قم بالذهاب لصفحة تحديد الموقع و الاذكار ", "OK");
                        }
                    }
                }
                else
                {
                    try
                    {
                        var locator = CrossGeolocator.Current;
                        var position = await locator.GetPositionAsync(TimeSpan.FromSeconds(560), null);
                        savedPosition = position;
                        XmlDocument cityxml = new XmlDocument();
                        cityxml.Load("https://maps.googleapis.com/maps/api/geocode/xml?latlng=" + position.Latitude + "," + position.Longitude + "&location_type=ROOFTOP&result_type=street_address&key=AIzaSyDdXtH7SX4CmpOoHdW2pFfjdIqYpYvFURk");

                        XmlNodeList cityy = cityxml.GetElementsByTagName("result");
                        XmlNode xcity = cityy.Item(0);
                        string citystring = xcity.SelectSingleNode("address_component[5]/long_name").InnerText;
                        citylbl.Text = citystring + "موقعك الحالي ";
                        LocationDB locattributes = new LocationDB(Path.Combine(Environment.GetFolderPath(Environment.SpecialFolder.LocalApplicationData), "location.db3"));
                        locattributes.AddLoc(new LocationModel() { City = citystring, Longitude = position.Longitude, Latitude = position.Latitude });
                        var client = new WebClient();
                        var content = client.DownloadString("https://api.sunrise-sunset.org/json?lat=" + position.Latitude + "&lng=" + position.Longitude + "&date=today");
                        var sb = new StringBuilder(content);
                        sb.Replace("\\\t", "\t");
                        JToken token = JToken.Parse(sb.ToString());
                        string sunrise = token.SelectToken("results.sunrise").ToString();
                        rise.Text = sunrise + "موعد اذكار الصباح ";
                        string t = sunrise.Replace("AM", "");
                        TimeSpan val = TimeSpan.Parse(t);
                        DateTime val2 = DateTime.Today.AddMinutes(val.Minutes);
                        val2 = DateTime.Today.AddHours(val.Hours).AddMinutes(val.Minutes);
                        var main = new Main();
                        azkar.Add(new alarmproperties { time = val2, title = "اذكار الصباح", body = "اصبحنا و اصبح الملك لله" });
                        string sunset = token.SelectToken("results.sunset").ToString();
                        set.Text = sunset + "موعد اذكار المساء";

                        string s = sunset.Replace("PM", "");
                        TimeSpan sunsettime = TimeSpan.Parse(s);
                        DateTime sunsetalarm = DateTime.Today.AddMinutes(sunsettime.Minutes);
                        sunsetalarm = DateTime.Today.AddHours(sunsettime.Hours).AddMinutes(sunsettime.Minutes);
                        var sunsetpm = sunsetalarm.AddHours(Double.Parse("12"));
                        azkar.Add(new alarmproperties { time = sunsetpm, title = "اذكار المساء", body = "امسينا و امسي الملك لله" });
                    }
                    catch (Exception e)
                    {
                    await DisplayAlert("تعذر تحديد موقعك", "من فضلك قم بالتأكد من تشغيل الانترنت و محدد الموقع و قم بالذهاب لصفحة تحديد الموقع و الاذكار ", "OK");

                }
            }
            }
            }
    }